{
  "weeks": [
    {
      "week": 1,
      "title": "Launching the Inquiry: What is a Healthy Democracy?",
      "lessons": [
        {
          "id": "wk1-hook",
          "title": "Hook & Prior Knowledge",
          "duration": "60 min",
          "tags": ["Inquiry launch", "Democracy"],
          "objectives": [
            "Activate prior knowledge about Australian democratic systems.",
            "Define what makes a democracy healthy and trustworthy."
          ],
          "steps": [
            "Gallery walk of headlines about trust in institutions and dot voting conversation starter.",
            "Mini lecture introducing participation, fairness, accountability and separation of powers.",
            "Class reframes the inquiry question for the unit and captures initial wonderings."
          ],
          "successCriteria": [
            "I can name two features of a healthy democracy.",
            "I can explain why trust matters for democratic participation."
          ],
          "standardsRefs": ["AC9HC9K01"]
        },
        {
          "id": "wk1-questions",
          "title": "Question Crafting (AC9HC9S01)",
          "duration": "55 min",
          "tags": ["Inquiry", "Collaboration"],
          "objectives": [
            "Generate compelling questions about constitutional change, courts and civic participation.",
            "Sort questions into themes and identify information needs."
          ],
          "steps": [
            "Students draft three questions individually using question stems.",
            "Teams sort questions into themes, prioritising one per theme.",
            "Class agrees on research teams and success criteria for investigation."
          ],
          "successCriteria": [
            "I can write a question that can be investigated with evidence.",
            "I can explain the focus area for my research team."
          ],
          "standardsRefs": ["AC9HC9S01", "AC9HC9S02"]
        }
      ]
    },
    {
      "week": 2,
      "title": "Constitution & Change (AC9HC9K01)",
      "lessons": [
        {
          "id": "wk2-federation",
          "title": "Federation to Referendums",
          "duration": "65 min",
          "tags": ["History", "Analysis"],
          "objectives": [
            "Describe why Australia federated and the compromises embedded in the Constitution.",
            "Analyse referendum case studies to determine why change succeeds or fails."
          ],
          "steps": [
            "Timeline jigsaw summarising key people, compromises and sections of the Constitution.",
            "Group carousel comparing the 1967 Referendum and 1999 Republic proposal.",
            "Reflection on what makes constitutional change difficult."
          ],
          "successCriteria": [
            "I can retell the big steps that led to the Australian Constitution.",
            "I can identify factors that increase the chance of a successful referendum."
          ],
          "standardsRefs": ["AC9HC9K01"]
        },
        {
          "id": "wk2-policy",
          "title": "Policy to Law (AC9HC9K02)",
          "duration": "60 min",
          "tags": ["Civics", "Systems thinking"],
          "objectives": [
            "Explain the stages of how a federal policy becomes a law.",
            "Map the influence points for citizens, media and interest groups."
          ],
          "steps": [
            "Interactive flowchart of idea → bill → committees → vote → assent.",
            "Teams map influence points on a contemporary bill.",
            "Exit ticket: pinpoint where public participation can influence the process."
          ],
          "successCriteria": [
            "I can describe each stage of the federal law-making process.",
            "I can highlight an influence point for a selected stakeholder."
          ],
          "standardsRefs": ["AC9HC9K02", "AC9HC9S04"]
        }
      ]
    },
    {
      "week": 3,
      "title": "Courts, Rights & Justice (AC9HC9K03–K04)",
      "lessons": [
        {
          "id": "wk3-courts",
          "title": "Court Hierarchy & Roles",
          "duration": "60 min",
          "tags": ["Justice", "Role play"],
          "objectives": [
            "Describe the jurisdictions of Australian courts.",
            "Compare responsibilities of judges, juries and legal representatives."
          ],
          "steps": [
            "Build a court hierarchy ladder using cards and scenarios.",
            "Stations exploring roles in criminal and civil trials.",
            "Class discussion: how courts help uphold democratic values."
          ],
          "successCriteria": [
            "I can place a case in the correct court.",
            "I can explain one role in a courtroom and why it matters."
          ],
          "standardsRefs": ["AC9HC9K03", "AC9HC9K04"]
        },
        {
          "id": "wk3-precedent",
          "title": "Precedent & Interpretation",
          "duration": "55 min",
          "tags": ["Analysis", "Critical thinking"],
          "objectives": [
            "Analyse how High Court decisions create precedent.",
            "Evaluate why interpretation can expand rights over time."
          ],
          "steps": [
            "Mini case study on Mabo and the Native Title Act.",
            "Pairs annotate how precedent changes the law and protects rights.",
            "Exit ticket: link precedent to a healthy democracy."
          ],
          "successCriteria": [
            "I can summarise how the High Court can change the law through precedent.",
            "I can give an example of a right strengthened by interpretation."
          ],
          "standardsRefs": ["AC9HC9K03", "AC9HC9K04", "AC9HC9S03"]
        }
      ]
    },
    {
      "week": 4,
      "title": "Media, Identity & Trust (AC9HC9K06)",
      "lessons": [
        {
          "id": "wk4-media",
          "title": "Media Representations",
          "duration": "55 min",
          "tags": ["Media literacy", "Critical thinking"],
          "objectives": [
            "Analyse how media narratives shape identity and civic trust.",
            "Identify bias techniques in a range of headlines."
          ],
          "steps": [
            "Students annotate how groups are portrayed across sport and news clips.",
            "Bias detector challenge: rewrite headlines to remove bias.",
            "Quick-write: how representation shapes belonging."
          ],
          "successCriteria": [
            "I can identify one bias strategy in a media headline.",
            "I can explain how media can build or damage trust in democracy."
          ],
          "standardsRefs": ["AC9HC9K06", "AC9HC9S03"]
        },
        {
          "id": "wk4-sources",
          "title": "Source Reliability Clinic",
          "duration": "60 min",
          "tags": ["Evaluation", "Research"],
          "objectives": [
            "Evaluate the reliability of multiple sources about the same civic issue.",
            "Compare reasoning to determine which sources to trust for a decision."
          ],
          "steps": [
            "Teams apply the CRAAP/RECAP test to three curated sources.",
            "Gallery walk to defend rankings and question each other.",
            "Class co-constructs a checklist for trustworthy evidence."
          ],
          "successCriteria": [
            "I can justify why a source is credible or questionable.",
            "I can recommend which source best informs a civic decision."
          ],
          "standardsRefs": ["AC9HC9S02", "AC9HC9S03"]
        }
      ]
    },
    {
      "week": 5,
      "title": "Civic Action Project – Discover & Design (AC9HC9S04)",
      "lessons": [
        {
          "id": "wk5-needs",
          "title": "Needs Analysis & Stakeholders",
          "duration": "65 min",
          "tags": ["Project", "Community"],
          "objectives": [
            "Investigate a local issue affecting democratic participation or fairness.",
            "Map stakeholder perspectives to inform action planning."
          ],
          "steps": [
            "Teams brainstorm possible school/community issues using provocations.",
            "Stakeholder mapping carousel to capture interests, power and influence.",
            "Teams select priority issue and gather baseline evidence."
          ],
          "successCriteria": [
            "I can explain why our issue matters to democratic trust.",
            "I can show how at least three stakeholders experience the issue."
          ],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S02"]
        },
        {
          "id": "wk5-blueprint",
          "title": "Action Blueprint",
          "duration": "60 min",
          "tags": ["Planning", "Collaboration"],
          "objectives": [
            "Design a feasible civic action with clear goals and evaluation measures.",
            "Sequence tasks, roles and timelines for implementation."
          ],
          "steps": [
            "Teams draft goals, actions, timeline and consultation steps on a blueprint template.",
            "Peer feedback using 'warm and cool' protocol.",
            "Teams revise plan and identify evidence they will collect."
          ],
          "successCriteria": [
            "I can outline the actions my team will take and when.",
            "I can justify how our plan honours stakeholder voices."
          ],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S05"]
        }
      ]
    },
    {
      "week": 6,
      "title": "Civic Action Project – Build & Share",
      "lessons": [
        {
          "id": "wk6-prototype",
          "title": "Prototype & Feedback",
          "duration": "65 min",
          "tags": ["Project", "Design thinking"],
          "objectives": [
            "Create campaign materials that communicate the civic action effectively.",
            "Use critique to improve messaging and inclusivity."
          ],
          "steps": [
            "Teams build campaign artefacts (posters, videos, announcements).",
            "Peer gallery walk with feedback against success criteria.",
            "Teams action feedback and prepare sharing plan."
          ],
          "successCriteria": [
            "I can explain how our artefact invites others to participate.",
            "I can describe one change we made after feedback."
          ],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S05"]
        },
        {
          "id": "wk6-present",
          "title": "Presentations & Community Feedback",
          "duration": "60 min",
          "tags": ["Presentation", "Reflection"],
          "objectives": [
            "Share civic action proposals with peers and invited community members.",
            "Collect feedback to refine implementation and measure impact."
          ],
          "steps": [
            "Teams deliver 5–7 minute presentations followed by Q&A.",
            "Audience provides feedback using a strengths/questions protocol.",
            "Teams record next steps and adjustments to make."
          ],
          "successCriteria": [
            "I can present our action with evidence of need and feasibility.",
            "I can document next steps based on audience feedback."
          ],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S05"]
        }
      ]
    },
    {
      "week": 7,
      "title": "Synthesis & Argument (AC9HC9S05)",
      "lessons": [
        {
          "id": "wk7-plan",
          "title": "Plan the Essay",
          "duration": "55 min",
          "tags": ["Argument", "Writing"],
          "objectives": [
            "Organise evidence from the unit to respond to the inquiry question.",
            "Develop a thesis and supporting points for a persuasive essay."
          ],
          "steps": [
            "Review success criteria for evidence-based arguments.",
            "Students map evidence using PEEL/TEAL planners.",
            "Confer with teacher to refine thesis and paragraph focus."
          ],
          "successCriteria": [
            "I can state a clear position answering the inquiry question.",
            "I can match evidence to paragraphs in my plan."
          ],
          "standardsRefs": ["AC9HC9S05"]
        },
        {
          "id": "wk7-draft",
          "title": "Write & Confer",
          "duration": "70 min",
          "tags": ["Writing", "Feedback"],
          "objectives": [
            "Draft an evidence-based argument responding to the inquiry question.",
            "Use conferencing feedback to improve clarity and use of civics vocabulary."
          ],
          "steps": [
            "Students draft essays in class with conferencing checkpoints.",
            "Teacher and peers provide targeted feedback using rubrics.",
            "Students revise intros and conclusions with mini-lessons."
          ],
          "successCriteria": [
            "I can use civics terminology accurately in my writing.",
            "I can explain revisions made after feedback."
          ],
          "standardsRefs": ["AC9HC9S05"]
        }
      ]
    },
    {
      "week": 8,
      "title": "Reflection & Evaluation",
      "lessons": [
        {
          "id": "wk8-reflect",
          "title": "Did We Restore Trust?",
          "duration": "55 min",
          "tags": ["Reflection", "Metacognition"],
          "objectives": [
            "Evaluate shifts in personal trust of democratic institutions.",
            "Synthesize evidence of learning from the civic action project."
          ],
          "steps": [
            "Revisit Week 1 trust dots and compare class data.",
            "Students compose reflection letters highlighting growth and remaining questions.",
            "Circle discussion on future civic participation opportunities."
          ],
          "successCriteria": [
            "I can describe how my understanding of democracy has changed.",
            "I can name one action I will take to stay civically engaged."
          ],
          "standardsRefs": ["AC9HC9S05"]
        },
        {
          "id": "wk8-celebrate",
          "title": "Celebration & Next Steps",
          "duration": "50 min",
          "tags": ["Celebration", "Action planning"],
          "objectives": [
            "Share civic action outcomes with community partners.",
            "Plan next steps for sustaining impact beyond the unit."
          ],
          "steps": [
            "Gallery of artefacts and successes from the civic action project.",
            "Students identify commitments for continued participation and support.",
            "Class creates a shared action wall for ongoing updates."
          ],
          "successCriteria": [
            "I can articulate the impact of our civic action.",
            "I can outline one concrete next step for our class community."
          ],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S05"]
        }
      ]
    }
  ]
}
