{
  "dispositions": [
    {
      "id": "socially-conscious",
      "title": "Socially Conscious",
      "definition": "Takes responsibility for improving community wellbeing and notices where participation is uneven.",
      "iCan": [
        "I can notice when voices or needs are missing in our community evidence.",
        "I can plan an action that benefits people beyond my friendship group."
      ],
      "activities": [
        {
          "id": "sc-community-scan",
          "title": "Community Empathy Walk",
          "duration": "60 min",
          "type": ["Fieldwork", "Reflection"],
          "objectives": [
            "Observe local civic assets and needs through a democratic lens",
            "Gather qualitative evidence that will inform our civic action choices"
          ],
          "steps": [
            "Take a guided walk around the school or local area using empathy-mapping prompts.",
            "Capture photos/notes showing both healthy-democracy moments and friction points.",
            "Return to class, sort findings into strengths/needs and identify emerging themes."
          ],
          "successCriteria": [
            "I can describe at least two community strengths and two needs with evidence.",
            "I can propose one actionable improvement based on documented needs."
          ],
          "tags": ["community", "civic-action", "observation"],
          "standardsRefs": ["AC9HC9S04"]
        },
        {
          "id": "sc-feedback-studio",
          "title": "Civic Feedback Studio",
          "duration": "45 min",
          "type": ["Workshop", "Collaboration"],
          "objectives": [
            "Provide constructive feedback on peers' civic action prototypes",
            "Use community impact criteria to refine project decisions"
          ],
          "steps": [
            "Set up stations with success criteria for impact, feasibility and ethics.",
            "Teams share prototypes; peers leave warm/ cool feedback linked to criteria.",
            "Teams synthesise feedback and document the changes they will make next."
          ],
          "successCriteria": [
            "I can reference community impact or justice when giving feedback.",
            "I can explain how peer feedback improved our civic action plan."
          ],
          "tags": ["feedback", "civic-action", "collaboration"],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S05"]
        }
      ]
    },
    {
      "id": "discerning",
      "title": "Discerning",
      "definition": "Interrogates information, bias and perspective before acting.",
      "iCan": [
        "I can test the reliability of sources and explain my reasoning.",
        "I can compare perspectives to avoid single-story thinking."
      ],
      "activities": [
        {
          "id": "disc-evidence-audit",
          "title": "Evidence Audit Protocol",
          "duration": "50 min",
          "type": ["Protocol", "Critical Thinking"],
          "objectives": [
            "Evaluate the reliability and bias of sources gathered for our inquiry",
            "Prioritise evidence that offers balanced perspectives"
          ],
          "steps": [
            "Teams list every source currently in use for the project.",
            "Apply a reliability rubric (authorship, evidence, currency, bias) to rate each source.",
            "Decide keep/replace actions and record justification in the inquiry log."
          ],
          "successCriteria": [
            "I can justify why a source is trustworthy or biased using rubric language.",
            "I can show how our final evidence set balances multiple perspectives."
          ],
          "tags": ["media-literacy", "source-analysis"],
          "standardsRefs": ["AC9HC9S02", "AC9HC9S03"]
        },
        {
          "id": "disc-perspective-fishbowl",
          "title": "Perspective Fishbowl",
          "duration": "45 min",
          "type": ["Discussion", "Simulation"],
          "objectives": [
            "Analyse how different stakeholders view a democratic issue",
            "Practise questioning that surfaces assumptions and evidence"
          ],
          "steps": [
            "Assign stakeholder roles with briefing cards that include values and evidence snippets.",
            "Inner circle conducts a short dialogue while outer circle tracks bias/evidence cues.",
            "Swap roles and debrief: what shifted in understanding and what evidence was compelling?"
          ],
          "successCriteria": [
            "I can ask questions that clarify evidence or values driving a perspective.",
            "I can summarise two contrasting perspectives without adding judgement."
          ],
          "tags": ["discussion", "perspectives", "critical-thinking"],
          "standardsRefs": ["AC9HC9S03", "AC9HC9S05"]
        }
      ]
    },
    {
      "id": "principled",
      "title": "Principled",
      "definition": "Acts with integrity, honours rights and upholds fairness during civic participation.",
      "iCan": [
        "I can link my civic values to democratic principles like equity and accountability.",
        "I can make choices that keep advocacy respectful and lawful."
      ],
      "activities": [
        {
          "id": "pr-values-boundaries",
          "title": "Values & Boundaries Workshop",
          "duration": "40 min",
          "type": ["Reflection", "Ethics"],
          "objectives": [
            "Clarify personal civic values and connect them to democratic principles",
            "Establish non-negotiables for respectful group advocacy"
          ],
          "steps": [
            "Students map personal values to principles such as fairness, participation and accountability.",
            "Analyse case studies where activism crossed a line; identify what went wrong.",
            "Draft a team charter outlining norms and boundaries for ethical participation."
          ],
          "successCriteria": [
            "I can connect a personal value to a democratic principle we studied.",
            "I can state boundaries that keep our advocacy respectful and inclusive."
          ],
          "tags": ["ethics", "reflection", "civic-action"],
          "standardsRefs": ["AC9HC9K03", "AC9HC9S05"]
        },
        {
          "id": "pr-rights-clinic",
          "title": "Rights in Action Clinic",
          "duration": "55 min",
          "type": ["Case Study", "Problem Solving"],
          "objectives": [
            "Apply legal rights and responsibilities to authentic civic scenarios",
            "Design principled responses that respect due process"
          ],
          "steps": [
            "Groups analyse scenario cards (protest permits, online speech, policing encounters).",
            "Use fact sheets to identify the rights, responsibilities and limits involved.",
            "Plan a response that upholds fairness for all parties and present to the class gallery."
          ],
          "successCriteria": [
            "I can cite the specific right or responsibility relevant to a scenario.",
            "I can design an action that upholds fairness for everyone impacted."
          ],
          "tags": ["rights", "law", "problem-solving"],
          "standardsRefs": ["AC9HC9K04", "AC9HC9S04"]
        }
      ]
    }
  ]
}

