{
  "dispositions": [
    {
      "id": "socially-conscious",
      "title": "Socially Conscious",
      "definition": "Actively seeks to improve community wellbeing and recognises the civic responsibilities shared by all citizens.",
      "iCan": [
        "I can notice when voices are missing and invite them in.",
        "I can propose actions that strengthen fairness and inclusion.",
        "I can explain how civic systems impact people differently."
      ],
      "activities": [
        {
          "id": "sc-pulse",
          "title": "Community Pulse Check",
          "duration": "45 min",
          "type": ["discussion", "analysis"],
          "tags": ["Community", "Data"],
          "objectives": [
            "Collect evidence about how school or community members experience a civic issue.",
            "Identify patterns that suggest where support or action is needed."
          ],
          "steps": [
            "Students review survey or interview snippets capturing community viewpoints.",
            "Teams sort responses into themes and note urgent concerns.",
            "Class creates a pulse chart showing which issues need immediate attention."
          ],
          "successCriteria": [
            "I can summarise what our data says about community needs.",
            "I can recommend one action that responds to what people asked for."
          ],
          "standardsRefs": ["AC9HC9S02", "AC9HC9S04"]
        },
        {
          "id": "sc-equitywalk",
          "title": "Equity Walk",
          "duration": "50 min",
          "type": ["inquiry", "collaboration"],
          "tags": ["Equity", "Observation"],
          "objectives": [
            "Evaluate how learning spaces and processes support equitable participation.",
            "Co-design improvements that increase access and belonging."
          ],
          "steps": [
            "Pairs audit a learning space or online platform using an equity checklist.",
            "Students record barriers that might prevent participation.",
            "Teams pitch low-cost changes and prioritise ideas for implementation."
          ],
          "successCriteria": [
            "I can describe evidence of equitable and inequitable participation.",
            "I can suggest a change that improves access for a specific group."
          ],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S05"]
        }
      ]
    },
    {
      "id": "discerning",
      "title": "Discerning",
      "definition": "Evaluates information critically, questions assumptions and makes reasoned judgments before acting.",
      "iCan": [
        "I can test evidence for credibility and bias.",
        "I can compare perspectives before deciding what to believe.",
        "I can justify a decision with transparent criteria."
      ],
      "activities": [
        {
          "id": "dis-source-detective",
          "title": "Source Detective",
          "duration": "40 min",
          "type": ["analysis", "research"],
          "tags": ["Media literacy", "Critical thinking"],
          "objectives": [
            "Interrogate multiple sources covering the same story for bias and reliability.",
            "Construct evidence statements that acknowledge limitations."
          ],
          "steps": [
            "Students rotate through stations with contrasting articles and posts.",
            "Teams apply a credibility rubric and record anomalies or missing context.",
            "Each team crafts an evidence statement that balances the perspectives."
          ],
          "successCriteria": [
            "I can explain how bias shows up in a source.",
            "I can state whether I would trust a source and why."
          ],
          "standardsRefs": ["AC9HC9S02", "AC9HC9S03"]
        },
        {
          "id": "dis-algorithm",
          "title": "Algorithm Unboxed",
          "duration": "55 min",
          "type": ["inquiry", "digital literacy"],
          "tags": ["Technology", "Reflection"],
          "objectives": [
            "Analyse how recommendation algorithms shape what information citizens see.",
            "Develop strategies to diversify personal media feeds."
          ],
          "steps": [
            "Students compare screenshots of their feeds and identify patterns.",
            "Mini-lesson on filter bubbles and civic implications.",
            "Learners design a media remix plan with intentional sources."
          ],
          "successCriteria": [
            "I can describe how an algorithm influenced my information diet.",
            "I can list steps to broaden the perspectives I encounter online."
          ],
          "standardsRefs": ["AC9HC9K06", "AC9HC9S03"]
        }
      ]
    },
    {
      "id": "principled",
      "title": "Principled",
      "definition": "Acts with integrity, respects diverse perspectives and makes ethical choices when participating civically.",
      "iCan": [
        "I can explain how my values shape my decisions.",
        "I can listen actively and respond with respect, even when we disagree.",
        "I can evaluate civic actions for ethical impact."
      ],
      "activities": [
        {
          "id": "pr-ethics-circle",
          "title": "Ethical Debate Circle",
          "duration": "50 min",
          "type": ["discussion", "ethical reasoning"],
          "tags": ["Debate", "Respect"],
          "objectives": [
            "Examine a civic dilemma from multiple stakeholder perspectives.",
            "Practise protocols for respectful disagreement and consensus building."
          ],
          "steps": [
            "Students read a dilemma briefing and adopt stakeholder roles.",
            "Circle discussion using speaking tokens and reflection prompts.",
            "Groups craft a consensus statement noting ethical trade-offs."
          ],
          "successCriteria": [
            "I can articulate a perspective different from my own fairly.",
            "I can describe the ethical implications of the decision we reached."
          ],
          "standardsRefs": ["AC9HC9S03", "AC9HC9S05"]
        },
        {
          "id": "pr-action-reflect",
          "title": "Civic Action Reflection Studio",
          "duration": "45 min",
          "type": ["reflection", "portfolio"],
          "tags": ["Civic action", "Metacognition"],
          "objectives": [
            "Evaluate a recent civic action for impact and alignment with class values.",
            "Set personal commitments for principled participation in future contexts."
          ],
          "steps": [
            "Students review evidence from their civic action and annotate alignment with values.",
            "Individuals write a principled participation pledge with specific behaviours.",
            "Peer coaching conversation to refine commitments and accountability steps."
          ],
          "successCriteria": [
            "I can connect my civic action to shared democratic values.",
            "I can name a behaviour I will adopt to stay principled when acting."
          ],
          "standardsRefs": ["AC9HC9S04", "AC9HC9S05"]
        }
      ]
    }
  ]
}
